#pragma once
#include <string>
/*****************************************************************************
* @author : xiaoteng
* @date : 2021/10/26 9:31
* @last change : 
* @description : 系统环境变量相关操作
*****************************************************************************/
class EnvViriable
{
public:
	/*****************************************************************************
	@description : 
	@param: 	
	@retrun:  
	*****************************************************************************/
	std::string GetValue(std::string name);

	/*****************************************************************************
	@description : 设置程序加载的系统目录
	@param: 	
	@retrun:  
		>=0 success, <0 failed
	*****************************************************************************/
	int AppendPath(std::string path);

private:
	std::string value_;
};

